In [1]:
import numpy as np
import pandas as pd

In [2]:
data = {'Name':['swapnil','akshay','sunita','hema','tai','baburao', 'ganpat'],
       'Age':[24,21,45,48,75,85,50],
       'Place':['satara','satara','mangavli','satara','lanja','kot','ratnagiri'],
       'Pincode':[10,11,12,13,14,15,16]}

In [3]:
d = pd.DataFrame(data, index= list('ABCDEFG'))
d

      Name  Age      Place  Pincode
A  swapnil   24     satara       10
B   akshay   21     satara       11
C   sunita   45   mangavli       12
D     hema   48     satara       13
E      tai   75      lanja       14
F  baburao   85        kot       15
G   ganpat   50  ratnagiri       16

In [4]:
d.isna()

    Name    Age  Place  Pincode
A  False  False  False    False
B  False  False  False    False
C  False  False  False    False
D  False  False  False    False
E  False  False  False    False
F  False  False  False    False
G  False  False  False    False

In [5]:
# No of elements
d.size

28

In [6]:
# no of rows and columns
d.shape

(7, 4)

In [7]:
# no of rows
len(d)

7

In [8]:
# list of column name
d.columns

Index(['Name', 'Age', 'Place', 'Pincode'], dtype='object')

In [9]:
# dimension of data
d.ndim

2

In [10]:
# check values of dataframe
d.values

array([['swapnil', 24, 'satara', 10],
       ['akshay', 21, 'satara', 11],
       ['sunita', 45, 'mangavli', 12],
       ['hema', 48, 'satara', 13],
       ['tai', 75, 'lanja', 14],
       ['baburao', 85, 'kot', 15],
       ['ganpat', 50, 'ratnagiri', 16]], dtype=object)

In [11]:
# check index 
d.index

Index(['A', 'B', 'C', 'D', 'E', 'F', 'G'], dtype='object')

In [12]:
# fetch first five records
d.head()

      Name  Age     Place  Pincode
A  swapnil   24    satara       10
B   akshay   21    satara       11
C   sunita   45  mangavli       12
D     hema   48    satara       13
E      tai   75     lanja       14

In [13]:
# fetch last five records
d.tail()

      Name  Age      Place  Pincode
C   sunita   45   mangavli       12
D     hema   48     satara       13
E      tai   75      lanja       14
F  baburao   85        kot       15
G   ganpat   50  ratnagiri       16

In [14]:
# fetch 50% data
d[:len(d)//2]

      Name  Age     Place  Pincode
A  swapnil   24    satara       10
B   akshay   21    satara       11
C   sunita   45  mangavli       12

In [15]:
# descriptive statestics
d.describe()

             Age    Pincode
count   7.000000   7.000000
mean   49.714286  13.000000
std    23.788753   2.160247
min    21.000000  10.000000
25%    34.500000  11.500000
50%    48.000000  13.000000
75%    62.500000  14.500000
max    85.000000  16.000000

In [16]:
# consize summary of dataframe
d.info()

<class 'pandas.core.frame.DataFrame'>
Index: 7 entries, A to G
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     7 non-null      object
 1   Age      7 non-null      int64
 2   Place    7 non-null      object
 3   Pincode  7 non-null      int64
dtypes: int64(2), object(2)
memory usage: 280.0+ bytes

In [17]:
# findout no of missing values
d.isna().sum()

Name       0
Age        0
Place      0
Pincode    0
dtype: int64

In [18]:
d[:3]

      Name  Age     Place  Pincode
A  swapnil   24    satara       10
B   akshay   21    satara       11
C   sunita   45  mangavli       12

In [21]:
# select Column
d[['Name']]

      Name
A  swapnil
B   akshay
C   sunita
D     hema
E      tai
F  baburao
G   ganpat

In [23]:
# fetch records of sunita and hema
d.loc['C':'D',:] # endpoint is exclusive

     Name  Age     Place  Pincode
C  sunita   45  mangavli       12
D    hema   48    satara       13

In [27]:
# fetch name and age of tai and ganpat
d.iloc[4::2,:][['Name','Age']]

     Name  Age
E     tai   75
G  ganpat   50

In [29]:
# select specific datatype column
d.select_dtypes('int')

   Age  Pincode
A   24       10
B   21       11
C   45       12
D   48       13
E   75       14
F   85       15
G   50       16

In [31]:
# select specific datatype column
d.select_dtypes('object')

      Name      Place
A  swapnil     satara
B   akshay     satara
C   sunita   mangavli
D     hema     satara
E      tai      lanja
F  baburao        kot
G   ganpat  ratnagiri

In [33]:
# chexk datatype
d.dtypes

Name       object
Age         int64
Place      object
Pincode     int64
dtype: object

In [36]:
# how many people from same place
d.Place.value_counts()

satara       3
mangavli     1
lanja        1
kot          1
ratnagiri    1
Name: Place, dtype: int64

In [40]:
d = d.append({'Name':'Baby','Age':17}, ignore_index=True)
d

      Name  Age      Place  Pincode
0  swapnil   24     satara     10.0
1   akshay   21     satara     11.0
2   sunita   45   mangavli     12.0
3     hema   48     satara     13.0
4      tai   75      lanja     14.0
5  baburao   85        kot     15.0
6   ganpat   50  ratnagiri     16.0
7     Baby   17        NaN      NaN

In [42]:
# how to replace any element from dataframe(akshay --> AKSHAY)
d.Name.replace({'akshay':'AKSHAY'}, inplace=True)

In [43]:
d

      Name  Age      Place  Pincode
0  swapnil   24     satara     10.0
1   AKSHAY   21     satara     11.0
2   sunita   45   mangavli     12.0
3     hema   48     satara     13.0
4      tai   75      lanja     14.0
5  baburao   85        kot     15.0
6   ganpat   50  ratnagiri     16.0
7     Baby   17        NaN      NaN

In [44]:
# fetch records from satara
d.groupby('Place').get_group('satara')

      Name  Age   Place  Pincode
0  swapnil   24  satara     10.0
1   AKSHAY   21  satara     11.0
3     hema   48  satara     13.0

In [45]:
# fetch records whose age is more than 30
d.query('Age > 30')

      Name  Age      Place  Pincode
2   sunita   45   mangavli     12.0
3     hema   48     satara     13.0
4      tai   75      lanja     14.0
5  baburao   85        kot     15.0
6   ganpat   50  ratnagiri     16.0

In [46]:
# fetch records whose age is more than 30 and from satara
d.query('Age>30 & Place == "satara"')

   Name  Age   Place  Pincode
3  hema   48  satara     13.0

In [47]:
d.isna().sum()

Name       0
Age        0
Place      1
Pincode    1
dtype: int64

In [48]:
d.ffill()

      Name  Age      Place  Pincode
0  swapnil   24     satara     10.0
1   AKSHAY   21     satara     11.0
2   sunita   45   mangavli     12.0
3     hema   48     satara     13.0
4      tai   75      lanja     14.0
5  baburao   85        kot     15.0
6   ganpat   50  ratnagiri     16.0
7     Baby   17  ratnagiri     16.0

In [49]:
d

      Name  Age      Place  Pincode
0  swapnil   24     satara     10.0
1   AKSHAY   21     satara     11.0
2   sunita   45   mangavli     12.0
3     hema   48     satara     13.0
4      tai   75      lanja     14.0
5  baburao   85        kot     15.0
6   ganpat   50  ratnagiri     16.0
7     Baby   17        NaN      NaN

In [51]:
d.Pincode.fillna('15', inplace=True)

In [52]:
d

      Name  Age      Place Pincode
0  swapnil   24     satara    10.0
1   AKSHAY   21     satara    11.0
2   sunita   45   mangavli    12.0
3     hema   48     satara    13.0
4      tai   75      lanja    14.0
5  baburao   85        kot    15.0
6   ganpat   50  ratnagiri    16.0
7     Baby   17        NaN      15

In [55]:
d.groupby(['Name','Place']).get_group(('AKSHAY','satara'))

     Name  Age   Place Pincode
1  AKSHAY   21  satara    11.0

In [62]:
d[(d.Name == 'swapnil') & (d.Age == 24)]

      Name  Age   Place Pincode
0  swapnil   24  satara    10.0

In [65]:
d['Multi'] = d.Age * d.Pincode

In [66]:
d

      Name  Age      Place Pincode                               Multi
0  swapnil   24     satara    10.0                               240.0
1   AKSHAY   21     satara    11.0                               231.0
2   sunita   45   mangavli    12.0                               540.0
3     hema   48     satara    13.0                               624.0
4      tai   75      lanja    14.0                              1050.0
5  baburao   85        kot    15.0                              1275.0
6   ganpat   50  ratnagiri    16.0                               800.0
7     Baby   17        NaN      15  1515151515151515151515151515151515